@echo off
REM Отключает вывод выполняемых команд на экран. Без этого каждая строка скрипта печаталась бы в консоль перед выполнением, и было бы грязно. @ в начале — чтобы сама эта строка тоже не отображалась.

chcp 1251 > log
REM «change code page», меняет кодировку консоли. 1251 — кодировка Windows для кириллицы (чтобы русский текст выводился нормально

del log

set CPP_FILES="io.cpp sortings.cpp main.cpp"
REM Создаёт переменную CPP_FILES, в которой лежит список исходных файлов C++. Дальше можно использовать %CPP_FILES%, чтобы не писать их заново.

set EXE=my_correct_sort.exe
REM Переменная EXE — имя итогового исполняемого файла (.exe), который получится после компиляции.

set CHARSET="-finput-charset=utf-8 -fexec-charset=windows-1251"
REM -finput-charset=utf-8 — .cpp файлы сохранены в UTF-8, компилятор должен читать их как UTF-8.
REM -fexec-charset=windows-1251 — строковые литералы внутри программы (например, "Введите размер массива") должны быть в кодировке Windows-1251, чтобы корректно отображаться в консоли Windows.

if exist %EXE% del %EXE%
REM Если файл my_correct_sort.exe уже существует от прошлой сборки — удалить его. Это чтобы не запустить случайно старую версию, если компиляция упадёт с ошибкой.

g++ "%CHARSET%" "%CPP_FILES%" -o %EXE%
REM -o %EXE% → -o my_correct_sort.exe — имя выходного файла.

%EXE%
REM Запускаем файл 
